Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/include/component/emafe.h
/*
 * Component description for EMAFE
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-04-29T12:45:09Z */
#ifndef _PIC32CXMTSH_EMAFE_COMPONENT_H_
#define _PIC32CXMTSH_EMAFE_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR EMAFE                                        */
/* ************************************************************************** */

/* -------- EMAFE_CR : (EMAFE Offset: 0x00) ( /W 32) Control Register -------- */
#define EMAFE_CR_SWRST_Pos                    _UINT32_(0)                                          /* (EMAFE_CR) Software Reset Position */
#define EMAFE_CR_SWRST_Msk                    (_UINT32_(0x1) << EMAFE_CR_SWRST_Pos)                /* (EMAFE_CR) Software Reset Mask */
#define EMAFE_CR_SWRST(value)                 (EMAFE_CR_SWRST_Msk & (_UINT32_(value) << EMAFE_CR_SWRST_Pos)) /* Assigment of value for SWRST in the EMAFE_CR register */
#define EMAFE_CR_SWRST_DECIM_Pos              _UINT32_(1)                                          /* (EMAFE_CR) Sinc Decimation Filters Reset Position */
#define EMAFE_CR_SWRST_DECIM_Msk              (_UINT32_(0x1) << EMAFE_CR_SWRST_DECIM_Pos)          /* (EMAFE_CR) Sinc Decimation Filters Reset Mask */
#define EMAFE_CR_SWRST_DECIM(value)           (EMAFE_CR_SWRST_DECIM_Msk & (_UINT32_(value) << EMAFE_CR_SWRST_DECIM_Pos)) /* Assigment of value for SWRST_DECIM in the EMAFE_CR register */
#define EMAFE_CR_Msk                          _UINT32_(0x00000003)                                 /* (EMAFE_CR) Register Mask  */


/* -------- EMAFE_MR : (EMAFE Offset: 0x04) (R/W 32) Mode Register -------- */
#define EMAFE_MR_LPF_ON0_Pos                  _UINT32_(0)                                          /* (EMAFE_MR) Low-Pass Filter 0 On Position */
#define EMAFE_MR_LPF_ON0_Msk                  (_UINT32_(0x1) << EMAFE_MR_LPF_ON0_Pos)              /* (EMAFE_MR) Low-Pass Filter 0 On Mask */
#define EMAFE_MR_LPF_ON0(value)               (EMAFE_MR_LPF_ON0_Msk & (_UINT32_(value) << EMAFE_MR_LPF_ON0_Pos)) /* Assigment of value for LPF_ON0 in the EMAFE_MR register */
#define EMAFE_MR_LPF_ON1_Pos                  _UINT32_(1)                                          /* (EMAFE_MR) Low-Pass Filter 1 On Position */
#define EMAFE_MR_LPF_ON1_Msk                  (_UINT32_(0x1) << EMAFE_MR_LPF_ON1_Pos)              /* (EMAFE_MR) Low-Pass Filter 1 On Mask */
#define EMAFE_MR_LPF_ON1(value)               (EMAFE_MR_LPF_ON1_Msk & (_UINT32_(value) << EMAFE_MR_LPF_ON1_Pos)) /* Assigment of value for LPF_ON1 in the EMAFE_MR register */
#define EMAFE_MR_LPF_ON2_Pos                  _UINT32_(2)                                          /* (EMAFE_MR) Low-Pass Filter 2 On Position */
#define EMAFE_MR_LPF_ON2_Msk                  (_UINT32_(0x1) << EMAFE_MR_LPF_ON2_Pos)              /* (EMAFE_MR) Low-Pass Filter 2 On Mask */
#define EMAFE_MR_LPF_ON2(value)               (EMAFE_MR_LPF_ON2_Msk & (_UINT32_(value) << EMAFE_MR_LPF_ON2_Pos)) /* Assigment of value for LPF_ON2 in the EMAFE_MR register */
#define EMAFE_MR_LPF_ON3_Pos                  _UINT32_(3)                                          /* (EMAFE_MR) Low-Pass Filter 3 On Position */
#define EMAFE_MR_LPF_ON3_Msk                  (_UINT32_(0x1) << EMAFE_MR_LPF_ON3_Pos)              /* (EMAFE_MR) Low-Pass Filter 3 On Mask */
#define EMAFE_MR_LPF_ON3(value)               (EMAFE_MR_LPF_ON3_Msk & (_UINT32_(value) << EMAFE_MR_LPF_ON3_Pos)) /* Assigment of value for LPF_ON3 in the EMAFE_MR register */
#define EMAFE_MR_LPF_ON4_Pos                  _UINT32_(4)                                          /* (EMAFE_MR) Low-Pass Filter 4 On Position */
#define EMAFE_MR_LPF_ON4_Msk                  (_UINT32_(0x1) << EMAFE_MR_LPF_ON4_Pos)              /* (EMAFE_MR) Low-Pass Filter 4 On Mask */
#define EMAFE_MR_LPF_ON4(value)               (EMAFE_MR_LPF_ON4_Msk & (_UINT32_(value) << EMAFE_MR_LPF_ON4_Pos)) /* Assigment of value for LPF_ON4 in the EMAFE_MR register */
#define EMAFE_MR_DMA_ON_Pos                   _UINT32_(7)                                          /* (EMAFE_MR) Direct Memory Access On Position */
#define EMAFE_MR_DMA_ON_Msk                   (_UINT32_(0x1) << EMAFE_MR_DMA_ON_Pos)               /* (EMAFE_MR) Direct Memory Access On Mask */
#define EMAFE_MR_DMA_ON(value)                (EMAFE_MR_DMA_ON_Msk & (_UINT32_(value) << EMAFE_MR_DMA_ON_Pos)) /* Assigment of value for DMA_ON in the EMAFE_MR register */
#define EMAFE_MR_DMACH0_Pos                   _UINT32_(8)                                          /* (EMAFE_MR) Channel 0 Enable for DMA transfer Position */
#define EMAFE_MR_DMACH0_Msk                   (_UINT32_(0x1) << EMAFE_MR_DMACH0_Pos)               /* (EMAFE_MR) Channel 0 Enable for DMA transfer Mask */
#define EMAFE_MR_DMACH0(value)                (EMAFE_MR_DMACH0_Msk & (_UINT32_(value) << EMAFE_MR_DMACH0_Pos)) /* Assigment of value for DMACH0 in the EMAFE_MR register */
#define EMAFE_MR_DMACH1_Pos                   _UINT32_(9)                                          /* (EMAFE_MR) Channel 1 Enable for DMA transfer Position */
#define EMAFE_MR_DMACH1_Msk                   (_UINT32_(0x1) << EMAFE_MR_DMACH1_Pos)               /* (EMAFE_MR) Channel 1 Enable for DMA transfer Mask */
#define EMAFE_MR_DMACH1(value)                (EMAFE_MR_DMACH1_Msk & (_UINT32_(value) << EMAFE_MR_DMACH1_Pos)) /* Assigment of value for DMACH1 in the EMAFE_MR register */
#define EMAFE_MR_DMACH2_Pos                   _UINT32_(10)                                         /* (EMAFE_MR) Channel 2 Enable for DMA transfer Position */
#define EMAFE_MR_DMACH2_Msk                   (_UINT32_(0x1) << EMAFE_MR_DMACH2_Pos)               /* (EMAFE_MR) Channel 2 Enable for DMA transfer Mask */
#define EMAFE_MR_DMACH2(value)                (EMAFE_MR_DMACH2_Msk & (_UINT32_(value) << EMAFE_MR_DMACH2_Pos)) /* Assigment of value for DMACH2 in the EMAFE_MR register */
#define EMAFE_MR_DMACH3_Pos                   _UINT32_(11)                                         /* (EMAFE_MR) Channel 3 Enable for DMA transfer Position */
#define EMAFE_MR_DMACH3_Msk                   (_UINT32_(0x1) << EMAFE_MR_DMACH3_Pos)               /* (EMAFE_MR) Channel 3 Enable for DMA transfer Mask */
#define EMAFE_MR_DMACH3(value)                (EMAFE_MR_DMACH3_Msk & (_UINT32_(value) << EMAFE_MR_DMACH3_Pos)) /* Assigment of value for DMACH3 in the EMAFE_MR register */
#define EMAFE_MR_DMACH4_Pos                   _UINT32_(12)                                         /* (EMAFE_MR) Channel 4 Enable for DMA transfer Position */
#define EMAFE_MR_DMACH4_Msk                   (_UINT32_(0x1) << EMAFE_MR_DMACH4_Pos)               /* (EMAFE_MR) Channel 4 Enable for DMA transfer Mask */
#define EMAFE_MR_DMACH4(value)                (EMAFE_MR_DMACH4_Msk & (_UINT32_(value) << EMAFE_MR_DMACH4_Pos)) /* Assigment of value for DMACH4 in the EMAFE_MR register */
#define EMAFE_MR_VAR_ON_Pos                   _UINT32_(15)                                         /* (EMAFE_MR) Variation Detection On Position */
#define EMAFE_MR_VAR_ON_Msk                   (_UINT32_(0x1) << EMAFE_MR_VAR_ON_Pos)               /* (EMAFE_MR) Variation Detection On Mask */
#define EMAFE_MR_VAR_ON(value)                (EMAFE_MR_VAR_ON_Msk & (_UINT32_(value) << EMAFE_MR_VAR_ON_Pos)) /* Assigment of value for VAR_ON in the EMAFE_MR register */
#define EMAFE_MR_VAR_CH_Pos                   _UINT32_(16)                                         /* (EMAFE_MR) Variation Detection Channel Selection Position */
#define EMAFE_MR_VAR_CH_Msk                   (_UINT32_(0x7) << EMAFE_MR_VAR_CH_Pos)               /* (EMAFE_MR) Variation Detection Channel Selection Mask */
#define EMAFE_MR_VAR_CH(value)                (EMAFE_MR_VAR_CH_Msk & (_UINT32_(value) << EMAFE_MR_VAR_CH_Pos)) /* Assigment of value for VAR_CH in the EMAFE_MR register */
#define   EMAFE_MR_VAR_CH_CH0_Val             _UINT32_(0x0)                                        /* (EMAFE_MR) Channel 0 is selected.  */
#define   EMAFE_MR_VAR_CH_CH1_Val             _UINT32_(0x1)                                        /* (EMAFE_MR) Channel 1 is selected.  */
#define   EMAFE_MR_VAR_CH_CH2_Val             _UINT32_(0x2)                                        /* (EMAFE_MR) Channel 2 is selected.  */
#define   EMAFE_MR_VAR_CH_CH3_Val             _UINT32_(0x3)                                        /* (EMAFE_MR) Channel 3 is selected.  */
#define   EMAFE_MR_VAR_CH_CH4_Val             _UINT32_(0x4)                                        /* (EMAFE_MR) Channel 4 is selected.  */
#define   EMAFE_MR_VAR_CH_CH5_Val             _UINT32_(0x5)                                        /* (EMAFE_MR) Channel 5 is selected.  */
#define   EMAFE_MR_VAR_CH_CH6_Val             _UINT32_(0x6)                                        /* (EMAFE_MR) Channel 6 is selected.  */
#define EMAFE_MR_VAR_CH_CH0                   (EMAFE_MR_VAR_CH_CH0_Val << EMAFE_MR_VAR_CH_Pos)     /* (EMAFE_MR) Channel 0 is selected. Position  */
#define EMAFE_MR_VAR_CH_CH1                   (EMAFE_MR_VAR_CH_CH1_Val << EMAFE_MR_VAR_CH_Pos)     /* (EMAFE_MR) Channel 1 is selected. Position  */
#define EMAFE_MR_VAR_CH_CH2                   (EMAFE_MR_VAR_CH_CH2_Val << EMAFE_MR_VAR_CH_Pos)     /* (EMAFE_MR) Channel 2 is selected. Position  */
#define EMAFE_MR_VAR_CH_CH3                   (EMAFE_MR_VAR_CH_CH3_Val << EMAFE_MR_VAR_CH_Pos)     /* (EMAFE_MR) Channel 3 is selected. Position  */
#define EMAFE_MR_VAR_CH_CH4                   (EMAFE_MR_VAR_CH_CH4_Val << EMAFE_MR_VAR_CH_Pos)     /* (EMAFE_MR) Channel 4 is selected. Position  */
#define EMAFE_MR_VAR_CH_CH5                   (EMAFE_MR_VAR_CH_CH5_Val << EMAFE_MR_VAR_CH_Pos)     /* (EMAFE_MR) Channel 5 is selected. Position  */
#define EMAFE_MR_VAR_CH_CH6                   (EMAFE_MR_VAR_CH_CH6_Val << EMAFE_MR_VAR_CH_Pos)     /* (EMAFE_MR) Channel 6 is selected. Position  */
#define EMAFE_MR_VAR_LIMIT_Pos                _UINT32_(20)                                         /* (EMAFE_MR) Variation Detection Limit for Event Triggering Position */
#define EMAFE_MR_VAR_LIMIT_Msk                (_UINT32_(0x3FF) << EMAFE_MR_VAR_LIMIT_Pos)          /* (EMAFE_MR) Variation Detection Limit for Event Triggering Mask */
#define EMAFE_MR_VAR_LIMIT(value)             (EMAFE_MR_VAR_LIMIT_Msk & (_UINT32_(value) << EMAFE_MR_VAR_LIMIT_Pos)) /* Assigment of value for VAR_LIMIT in the EMAFE_MR register */
#define EMAFE_MR_Msk                          _UINT32_(0x3FF79F9F)                                 /* (EMAFE_MR) Register Mask  */

#define EMAFE_MR_LPF_ON_Pos                   _UINT32_(0)                                          /* (EMAFE_MR Position) Low-Pass Filter x On */
#define EMAFE_MR_LPF_ON_Msk                   (_UINT32_(0x1F) << EMAFE_MR_LPF_ON_Pos)              /* (EMAFE_MR Mask) LPF_ON */
#define EMAFE_MR_LPF_ON(value)                (EMAFE_MR_LPF_ON_Msk & (_UINT32_(value) << EMAFE_MR_LPF_ON_Pos)) 
#define EMAFE_MR_DMACH_Pos                    _UINT32_(8)                                          /* (EMAFE_MR Position) Channel x Enable for DMA transfer */
#define EMAFE_MR_DMACH_Msk                    (_UINT32_(0x1F) << EMAFE_MR_DMACH_Pos)               /* (EMAFE_MR Mask) DMACH */
#define EMAFE_MR_DMACH(value)                 (EMAFE_MR_DMACH_Msk & (_UINT32_(value) << EMAFE_MR_DMACH_Pos)) 

