Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/include/component/emafe.h
/* -------- EMAFE_CDCR : (EMAFE Offset: 0x08) (R/W 32) Channels Difference Comparison Register -------- */
#define EMAFE_CDCR_CHA_IDX_Pos                _UINT32_(0)                                          /* (EMAFE_CDCR) First Channel to Compare Position */
#define EMAFE_CDCR_CHA_IDX_Msk                (_UINT32_(0x7) << EMAFE_CDCR_CHA_IDX_Pos)            /* (EMAFE_CDCR) First Channel to Compare Mask */
#define EMAFE_CDCR_CHA_IDX(value)             (EMAFE_CDCR_CHA_IDX_Msk & (_UINT32_(value) << EMAFE_CDCR_CHA_IDX_Pos)) /* Assigment of value for CHA_IDX in the EMAFE_CDCR register */
#define   EMAFE_CDCR_CHA_IDX_CH0_Val          _UINT32_(0x0)                                        /* (EMAFE_CDCR) Channel 0 is used to perform comparison.  */
#define   EMAFE_CDCR_CHA_IDX_CH1_Val          _UINT32_(0x1)                                        /* (EMAFE_CDCR) Channel 1 is used to perform comparison.  */
#define   EMAFE_CDCR_CHA_IDX_CH2_Val          _UINT32_(0x2)                                        /* (EMAFE_CDCR) Channel 2 is used to perform comparison.  */
#define   EMAFE_CDCR_CHA_IDX_CH3_Val          _UINT32_(0x3)                                        /* (EMAFE_CDCR) Channel 3 is used to perform comparison.  */
#define   EMAFE_CDCR_CHA_IDX_CH4_Val          _UINT32_(0x4)                                        /* (EMAFE_CDCR) Channel 4 is used to perform comparison.  */
#define   EMAFE_CDCR_CHA_IDX_CH5_Val          _UINT32_(0x5)                                        /* (EMAFE_CDCR) Channel 5 is used to perform comparison.  */
#define   EMAFE_CDCR_CHA_IDX_CH6_Val          _UINT32_(0x6)                                        /* (EMAFE_CDCR) Channel 6 is used to perform comparison.  */
#define EMAFE_CDCR_CHA_IDX_CH0                (EMAFE_CDCR_CHA_IDX_CH0_Val << EMAFE_CDCR_CHA_IDX_Pos) /* (EMAFE_CDCR) Channel 0 is used to perform comparison. Position  */
#define EMAFE_CDCR_CHA_IDX_CH1                (EMAFE_CDCR_CHA_IDX_CH1_Val << EMAFE_CDCR_CHA_IDX_Pos) /* (EMAFE_CDCR) Channel 1 is used to perform comparison. Position  */
#define EMAFE_CDCR_CHA_IDX_CH2                (EMAFE_CDCR_CHA_IDX_CH2_Val << EMAFE_CDCR_CHA_IDX_Pos) /* (EMAFE_CDCR) Channel 2 is used to perform comparison. Position  */
#define EMAFE_CDCR_CHA_IDX_CH3                (EMAFE_CDCR_CHA_IDX_CH3_Val << EMAFE_CDCR_CHA_IDX_Pos) /* (EMAFE_CDCR) Channel 3 is used to perform comparison. Position  */
#define EMAFE_CDCR_CHA_IDX_CH4                (EMAFE_CDCR_CHA_IDX_CH4_Val << EMAFE_CDCR_CHA_IDX_Pos) /* (EMAFE_CDCR) Channel 4 is used to perform comparison. Position  */
#define EMAFE_CDCR_CHA_IDX_CH5                (EMAFE_CDCR_CHA_IDX_CH5_Val << EMAFE_CDCR_CHA_IDX_Pos) /* (EMAFE_CDCR) Channel 5 is used to perform comparison. Position  */
#define EMAFE_CDCR_CHA_IDX_CH6                (EMAFE_CDCR_CHA_IDX_CH6_Val << EMAFE_CDCR_CHA_IDX_Pos) /* (EMAFE_CDCR) Channel 6 is used to perform comparison. Position  */
#define EMAFE_CDCR_CHB_IDX_Pos                _UINT32_(4)                                          /* (EMAFE_CDCR) Second Channel to Compare Position */
#define EMAFE_CDCR_CHB_IDX_Msk                (_UINT32_(0x7) << EMAFE_CDCR_CHB_IDX_Pos)            /* (EMAFE_CDCR) Second Channel to Compare Mask */
#define EMAFE_CDCR_CHB_IDX(value)             (EMAFE_CDCR_CHB_IDX_Msk & (_UINT32_(value) << EMAFE_CDCR_CHB_IDX_Pos)) /* Assigment of value for CHB_IDX in the EMAFE_CDCR register */
#define   EMAFE_CDCR_CHB_IDX_CH0_Val          _UINT32_(0x0)                                        /* (EMAFE_CDCR) Channel 0 is used to perform comparison  */
#define   EMAFE_CDCR_CHB_IDX_CH1_Val          _UINT32_(0x1)                                        /* (EMAFE_CDCR) Channel 1 is used to perform comparison  */
#define   EMAFE_CDCR_CHB_IDX_CH2_Val          _UINT32_(0x2)                                        /* (EMAFE_CDCR) Channel 2 is used to perform comparison  */
#define   EMAFE_CDCR_CHB_IDX_CH3_Val          _UINT32_(0x3)                                        /* (EMAFE_CDCR) Channel 3 is used to perform comparison  */
#define   EMAFE_CDCR_CHB_IDX_CH4_Val          _UINT32_(0x4)                                        /* (EMAFE_CDCR) Channel 4 is used to perform comparison  */
#define   EMAFE_CDCR_CHB_IDX_CH5_Val          _UINT32_(0x5)                                        /* (EMAFE_CDCR) Channel 5 is used to perform comparison.  */
#define   EMAFE_CDCR_CHB_IDX_CH6_Val          _UINT32_(0x6)                                        /* (EMAFE_CDCR) Channel 6 is used to perform comparison.  */
#define EMAFE_CDCR_CHB_IDX_CH0                (EMAFE_CDCR_CHB_IDX_CH0_Val << EMAFE_CDCR_CHB_IDX_Pos) /* (EMAFE_CDCR) Channel 0 is used to perform comparison Position  */
#define EMAFE_CDCR_CHB_IDX_CH1                (EMAFE_CDCR_CHB_IDX_CH1_Val << EMAFE_CDCR_CHB_IDX_Pos) /* (EMAFE_CDCR) Channel 1 is used to perform comparison Position  */
#define EMAFE_CDCR_CHB_IDX_CH2                (EMAFE_CDCR_CHB_IDX_CH2_Val << EMAFE_CDCR_CHB_IDX_Pos) /* (EMAFE_CDCR) Channel 2 is used to perform comparison Position  */
#define EMAFE_CDCR_CHB_IDX_CH3                (EMAFE_CDCR_CHB_IDX_CH3_Val << EMAFE_CDCR_CHB_IDX_Pos) /* (EMAFE_CDCR) Channel 3 is used to perform comparison Position  */
#define EMAFE_CDCR_CHB_IDX_CH4                (EMAFE_CDCR_CHB_IDX_CH4_Val << EMAFE_CDCR_CHB_IDX_Pos) /* (EMAFE_CDCR) Channel 4 is used to perform comparison Position  */
#define EMAFE_CDCR_CHB_IDX_CH5                (EMAFE_CDCR_CHB_IDX_CH5_Val << EMAFE_CDCR_CHB_IDX_Pos) /* (EMAFE_CDCR) Channel 5 is used to perform comparison. Position  */
#define EMAFE_CDCR_CHB_IDX_CH6                (EMAFE_CDCR_CHB_IDX_CH6_Val << EMAFE_CDCR_CHB_IDX_Pos) /* (EMAFE_CDCR) Channel 6 is used to perform comparison. Position  */
#define EMAFE_CDCR_DIFFTYPE_Pos               _UINT32_(8)                                          /* (EMAFE_CDCR) Type of Comparison Position */
#define EMAFE_CDCR_DIFFTYPE_Msk               (_UINT32_(0x1) << EMAFE_CDCR_DIFFTYPE_Pos)           /* (EMAFE_CDCR) Type of Comparison Mask */
#define EMAFE_CDCR_DIFFTYPE(value)            (EMAFE_CDCR_DIFFTYPE_Msk & (_UINT32_(value) << EMAFE_CDCR_DIFFTYPE_Pos)) /* Assigment of value for DIFFTYPE in the EMAFE_CDCR register */
#define EMAFE_CDCR_DIFFCOUNT_Pos              _UINT32_(12)                                         /* (EMAFE_CDCR) Successive Comparison Event Count Position */
#define EMAFE_CDCR_DIFFCOUNT_Msk              (_UINT32_(0xF) << EMAFE_CDCR_DIFFCOUNT_Pos)          /* (EMAFE_CDCR) Successive Comparison Event Count Mask */
#define EMAFE_CDCR_DIFFCOUNT(value)           (EMAFE_CDCR_DIFFCOUNT_Msk & (_UINT32_(value) << EMAFE_CDCR_DIFFCOUNT_Pos)) /* Assigment of value for DIFFCOUNT in the EMAFE_CDCR register */
#define EMAFE_CDCR_DIFFTHRES_Pos              _UINT32_(16)                                         /* (EMAFE_CDCR) Threshold Position */
#define EMAFE_CDCR_DIFFTHRES_Msk              (_UINT32_(0xFFF) << EMAFE_CDCR_DIFFTHRES_Pos)        /* (EMAFE_CDCR) Threshold Mask */
#define EMAFE_CDCR_DIFFTHRES(value)           (EMAFE_CDCR_DIFFTHRES_Msk & (_UINT32_(value) << EMAFE_CDCR_DIFFTHRES_Pos)) /* Assigment of value for DIFFTHRES in the EMAFE_CDCR register */
#define EMAFE_CDCR_Msk                        _UINT32_(0x0FFFF177)                                 /* (EMAFE_CDCR) Register Mask  */


/* -------- EMAFE_EMR : (EMAFE Offset: 0x0C) (R/W 32) Extended Mode Register -------- */
#define EMAFE_EMR_FORMAT_Pos                  _UINT32_(0)                                          /* (EMAFE_EMR) Data Format Position */
#define EMAFE_EMR_FORMAT_Msk                  (_UINT32_(0x3) << EMAFE_EMR_FORMAT_Pos)              /* (EMAFE_EMR) Data Format Mask */
#define EMAFE_EMR_FORMAT(value)               (EMAFE_EMR_FORMAT_Msk & (_UINT32_(value) << EMAFE_EMR_FORMAT_Pos)) /* Assigment of value for FORMAT in the EMAFE_EMR register */
#define   EMAFE_EMR_FORMAT_NB_CHANNEL_Val     _UINT32_(0x0)                                        /* (EMAFE_EMR) Index of channel is added in register EMAFE_DMA_DATA. 24-bit dynamic range. (default).  */
#define   EMAFE_EMR_FORMAT_SIGNEXTEND_Val     _UINT32_(0x1)                                        /* (EMAFE_EMR) 24-bit value with sign extension up to 32-bit applied to registers EMAFE_DMA_DATA and EMAFE _DATAx. 24-bit dynamic range  */
#define   EMAFE_EMR_FORMAT_FULLRANGE_Val      _UINT32_(0x2)                                        /* (EMAFE_EMR) 32-bit full range signed extension is applied in EMAFE_DMA_DATA and EMAFE _DATAx. 32-bit dynamic range.  */
#define EMAFE_EMR_FORMAT_NB_CHANNEL           (EMAFE_EMR_FORMAT_NB_CHANNEL_Val << EMAFE_EMR_FORMAT_Pos) /* (EMAFE_EMR) Index of channel is added in register EMAFE_DMA_DATA. 24-bit dynamic range. (default). Position  */
#define EMAFE_EMR_FORMAT_SIGNEXTEND           (EMAFE_EMR_FORMAT_SIGNEXTEND_Val << EMAFE_EMR_FORMAT_Pos) /* (EMAFE_EMR) 24-bit value with sign extension up to 32-bit applied to registers EMAFE_DMA_DATA and EMAFE _DATAx. 24-bit dynamic range Position  */
#define EMAFE_EMR_FORMAT_FULLRANGE            (EMAFE_EMR_FORMAT_FULLRANGE_Val << EMAFE_EMR_FORMAT_Pos) /* (EMAFE_EMR) 32-bit full range signed extension is applied in EMAFE_DMA_DATA and EMAFE _DATAx. 32-bit dynamic range. Position  */
#define EMAFE_EMR_MCLKDIV_LPF_Pos             _UINT32_(4)                                          /* (EMAFE_EMR) LPF Clock Prescaler Ratio Position */
#define EMAFE_EMR_MCLKDIV_LPF_Msk             (_UINT32_(0xF) << EMAFE_EMR_MCLKDIV_LPF_Pos)         /* (EMAFE_EMR) LPF Clock Prescaler Ratio Mask */
#define EMAFE_EMR_MCLKDIV_LPF(value)          (EMAFE_EMR_MCLKDIV_LPF_Msk & (_UINT32_(value) << EMAFE_EMR_MCLKDIV_LPF_Pos)) /* Assigment of value for MCLKDIV_LPF in the EMAFE_EMR register */
#define   EMAFE_EMR_MCLKDIV_LPF_MCLK_Val      _UINT32_(0x0)                                        /* (EMAFE_EMR) LPFIF clock is MCLK/1.  */
#define   EMAFE_EMR_MCLKDIV_LPF_MCLKDIV2_Val  _UINT32_(0x1)                                        /* (EMAFE_EMR) LPFIF clock is MCLK/2.  */
#define   EMAFE_EMR_MCLKDIV_LPF_MCLKDIV4_Val  _UINT32_(0x2)                                        /* (EMAFE_EMR) LPFIF clock is MCLK/4.  */
#define   EMAFE_EMR_MCLKDIV_LPF_MCLKDIV8_Val  _UINT32_(0x3)                                        /* (EMAFE_EMR) LPFIF clock is MCLK/8. (Default)  */
#define   EMAFE_EMR_MCLKDIV_LPF_MCLKDIV16_Val _UINT32_(0x4)                                        /* (EMAFE_EMR) LPFIF clock is MCLK/16.  */
#define   EMAFE_EMR_MCLKDIV_LPF_MCLKDIV32_Val _UINT32_(0x5)                                        /* (EMAFE_EMR) LPFIF clock is MCLK/32.  */
#define EMAFE_EMR_MCLKDIV_LPF_MCLK            (EMAFE_EMR_MCLKDIV_LPF_MCLK_Val << EMAFE_EMR_MCLKDIV_LPF_Pos) /* (EMAFE_EMR) LPFIF clock is MCLK/1. Position  */
#define EMAFE_EMR_MCLKDIV_LPF_MCLKDIV2        (EMAFE_EMR_MCLKDIV_LPF_MCLKDIV2_Val << EMAFE_EMR_MCLKDIV_LPF_Pos) /* (EMAFE_EMR) LPFIF clock is MCLK/2. Position  */
#define EMAFE_EMR_MCLKDIV_LPF_MCLKDIV4        (EMAFE_EMR_MCLKDIV_LPF_MCLKDIV4_Val << EMAFE_EMR_MCLKDIV_LPF_Pos) /* (EMAFE_EMR) LPFIF clock is MCLK/4. Position  */
#define EMAFE_EMR_MCLKDIV_LPF_MCLKDIV8        (EMAFE_EMR_MCLKDIV_LPF_MCLKDIV8_Val << EMAFE_EMR_MCLKDIV_LPF_Pos) /* (EMAFE_EMR) LPFIF clock is MCLK/8. (Default) Position  */
#define EMAFE_EMR_MCLKDIV_LPF_MCLKDIV16       (EMAFE_EMR_MCLKDIV_LPF_MCLKDIV16_Val << EMAFE_EMR_MCLKDIV_LPF_Pos) /* (EMAFE_EMR) LPFIF clock is MCLK/16. Position  */
#define EMAFE_EMR_MCLKDIV_LPF_MCLKDIV32       (EMAFE_EMR_MCLKDIV_LPF_MCLKDIV32_Val << EMAFE_EMR_MCLKDIV_LPF_Pos) /* (EMAFE_EMR) LPFIF clock is MCLK/32. Position  */
#define EMAFE_EMR_OSR_Pos                     _UINT32_(8)                                          /* (EMAFE_EMR) OSR of the Decimation Filters Position */
#define EMAFE_EMR_OSR_Msk                     (_UINT32_(0x7) << EMAFE_EMR_OSR_Pos)                 /* (EMAFE_EMR) OSR of the Decimation Filters Mask */
#define EMAFE_EMR_OSR(value)                  (EMAFE_EMR_OSR_Msk & (_UINT32_(value) << EMAFE_EMR_OSR_Pos)) /* Assigment of value for OSR in the EMAFE_EMR register */
#define   EMAFE_EMR_OSR_OSR8_Val              _UINT32_(0x0)                                        /* (EMAFE_EMR) OSR of the system is 8.  */
#define   EMAFE_EMR_OSR_OSR16_Val             _UINT32_(0x1)                                        /* (EMAFE_EMR) OSR of the system is 16.  */
#define   EMAFE_EMR_OSR_OSR32_Val             _UINT32_(0x2)                                        /* (EMAFE_EMR) OSR of the system is 32.  */
#define   EMAFE_EMR_OSR_OSR64_Val             _UINT32_(0x3)                                        /* (EMAFE_EMR) OSR of the system is 64 (Default).  */
#define EMAFE_EMR_OSR_OSR8                    (EMAFE_EMR_OSR_OSR8_Val << EMAFE_EMR_OSR_Pos)        /* (EMAFE_EMR) OSR of the system is 8. Position  */
#define EMAFE_EMR_OSR_OSR16                   (EMAFE_EMR_OSR_OSR16_Val << EMAFE_EMR_OSR_Pos)       /* (EMAFE_EMR) OSR of the system is 16. Position  */
#define EMAFE_EMR_OSR_OSR32                   (EMAFE_EMR_OSR_OSR32_Val << EMAFE_EMR_OSR_Pos)       /* (EMAFE_EMR) OSR of the system is 32. Position  */
#define EMAFE_EMR_OSR_OSR64                   (EMAFE_EMR_OSR_OSR64_Val << EMAFE_EMR_OSR_Pos)       /* (EMAFE_EMR) OSR of the system is 64 (Default). Position  */
#define EMAFE_EMR_Msk                         _UINT32_(0x000007F3)                                 /* (EMAFE_EMR) Register Mask  */


/* -------- EMAFE_DMA_DATA : (EMAFE Offset: 0x10) ( R/ 32) DMA Data Register -------- */
#define EMAFE_DMA_DATA_Msk                    _UINT32_(0x00000000)                                 /* (EMAFE_DMA_DATA) Register Mask  */

/* CH_INDEX_24BIT_DATA mode */
#define EMAFE_DMA_DATA_CH_INDEX_24BIT_DATA_DATA24_Pos _UINT32_(0)                                          /* (EMAFE_DMA_DATA) 24-bit Data read by DMA Position */
#define EMAFE_DMA_DATA_CH_INDEX_24BIT_DATA_DATA24_Msk (_UINT32_(0xFFFFFF) << EMAFE_DMA_DATA_CH_INDEX_24BIT_DATA_DATA24_Pos) /* (EMAFE_DMA_DATA) 24-bit Data read by DMA Mask */
#define EMAFE_DMA_DATA_CH_INDEX_24BIT_DATA_DATA24(value) (EMAFE_DMA_DATA_CH_INDEX_24BIT_DATA_DATA24_Msk & (_UINT32_(value) << EMAFE_DMA_DATA_CH_INDEX_24BIT_DATA_DATA24_Pos))
#define EMAFE_DMA_DATA_CH_INDEX_24BIT_DATA_CHIDX_Pos _UINT32_(24)                                         /* (EMAFE_DMA_DATA) Channel Index Position */
#define EMAFE_DMA_DATA_CH_INDEX_24BIT_DATA_CHIDX_Msk (_UINT32_(0xFF) << EMAFE_DMA_DATA_CH_INDEX_24BIT_DATA_CHIDX_Pos) /* (EMAFE_DMA_DATA) Channel Index Mask */
#define EMAFE_DMA_DATA_CH_INDEX_24BIT_DATA_CHIDX(value) (EMAFE_DMA_DATA_CH_INDEX_24BIT_DATA_CHIDX_Msk & (_UINT32_(value) << EMAFE_DMA_DATA_CH_INDEX_24BIT_DATA_CHIDX_Pos))
#define EMAFE_DMA_DATA_CH_INDEX_24BIT_DATA_Msk _UINT32_(0xFFFFFFFF)                                  /* (EMAFE_DMA_DATA_CH_INDEX_24BIT_DATA) Register Mask  */

/* ONLY_32BIT_DATA_SE24BIT mode */
#define EMAFE_DMA_DATA_ONLY_32BIT_DATA_SE24BIT_DATA24SE_Pos _UINT32_(0)                                          /* (EMAFE_DMA_DATA) Low-pass Filter 24-bit Data with 32-bit Sign Extension read by DMA Position */
#define EMAFE_DMA_DATA_ONLY_32BIT_DATA_SE24BIT_DATA24SE_Msk (_UINT32_(0xFFFFFFFF) << EMAFE_DMA_DATA_ONLY_32BIT_DATA_SE24BIT_DATA24SE_Pos) /* (EMAFE_DMA_DATA) Low-pass Filter 24-bit Data with 32-bit Sign Extension read by DMA Mask */
#define EMAFE_DMA_DATA_ONLY_32BIT_DATA_SE24BIT_DATA24SE(value) (EMAFE_DMA_DATA_ONLY_32BIT_DATA_SE24BIT_DATA24SE_Msk & (_UINT32_(value) << EMAFE_DMA_DATA_ONLY_32BIT_DATA_SE24BIT_DATA24SE_Pos))
#define EMAFE_DMA_DATA_ONLY_32BIT_DATA_SE24BIT_Msk _UINT32_(0xFFFFFFFF)                                  /* (EMAFE_DMA_DATA_ONLY_32BIT_DATA_SE24BIT) Register Mask  */

/* ONLY_32BIT_DATA mode */
#define EMAFE_DMA_DATA_ONLY_32BIT_DATA_DATA32_Pos _UINT32_(0)                                          /* (EMAFE_DMA_DATA) 32-bit Data read by DMA Position */
#define EMAFE_DMA_DATA_ONLY_32BIT_DATA_DATA32_Msk (_UINT32_(0xFFFFFFFF) << EMAFE_DMA_DATA_ONLY_32BIT_DATA_DATA32_Pos) /* (EMAFE_DMA_DATA) 32-bit Data read by DMA Mask */
#define EMAFE_DMA_DATA_ONLY_32BIT_DATA_DATA32(value) (EMAFE_DMA_DATA_ONLY_32BIT_DATA_DATA32_Msk & (_UINT32_(value) << EMAFE_DMA_DATA_ONLY_32BIT_DATA_DATA32_Pos))
#define EMAFE_DMA_DATA_ONLY_32BIT_DATA_Msk    _UINT32_(0xFFFFFFFF)                                  /* (EMAFE_DMA_DATA_ONLY_32BIT_DATA) Register Mask  */


