Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/include/component/emafe.h
/* -------- EMAFE_DATA : (EMAFE Offset: 0x14) ( R/ 32) Data Channel 0 Register -------- */
#define EMAFE_DATA_Msk                        _UINT32_(0x00000000)                                 /* (EMAFE_DATA) Register Mask  */

/* DATA_24BIT mode */
#define EMAFE_DATA_DATA_24BIT_DATA24_Pos      _UINT32_(0)                                          /* (EMAFE_DATA) Low-pass Filter 24-bit Signed Data Position */
#define EMAFE_DATA_DATA_24BIT_DATA24_Msk      (_UINT32_(0xFFFFFF) << EMAFE_DATA_DATA_24BIT_DATA24_Pos) /* (EMAFE_DATA) Low-pass Filter 24-bit Signed Data Mask */
#define EMAFE_DATA_DATA_24BIT_DATA24(value)   (EMAFE_DATA_DATA_24BIT_DATA24_Msk & (_UINT32_(value) << EMAFE_DATA_DATA_24BIT_DATA24_Pos))
#define EMAFE_DATA_DATA_24BIT_Msk             _UINT32_(0x00FFFFFF)                                  /* (EMAFE_DATA_DATA_24BIT) Register Mask  */

/* SE_24BIT_DATA mode */
#define EMAFE_DATA_SE_24BIT_DATA_DATA24SE_Pos _UINT32_(0)                                          /* (EMAFE_DATA) Low-pass Filter 24-bit Data with 32-bit Sign Extension Position */
#define EMAFE_DATA_SE_24BIT_DATA_DATA24SE_Msk (_UINT32_(0xFFFFFFFF) << EMAFE_DATA_SE_24BIT_DATA_DATA24SE_Pos) /* (EMAFE_DATA) Low-pass Filter 24-bit Data with 32-bit Sign Extension Mask */
#define EMAFE_DATA_SE_24BIT_DATA_DATA24SE(value) (EMAFE_DATA_SE_24BIT_DATA_DATA24SE_Msk & (_UINT32_(value) << EMAFE_DATA_SE_24BIT_DATA_DATA24SE_Pos))
#define EMAFE_DATA_SE_24BIT_DATA_Msk          _UINT32_(0xFFFFFFFF)                                  /* (EMAFE_DATA_SE_24BIT_DATA) Register Mask  */

/* DATA_32BIT mode */
#define EMAFE_DATA_DATA_32BIT_DATA32_Pos      _UINT32_(0)                                          /* (EMAFE_DATA) Low-pass Filter 32-bit Signed Data Position */
#define EMAFE_DATA_DATA_32BIT_DATA32_Msk      (_UINT32_(0xFFFFFFFF) << EMAFE_DATA_DATA_32BIT_DATA32_Pos) /* (EMAFE_DATA) Low-pass Filter 32-bit Signed Data Mask */
#define EMAFE_DATA_DATA_32BIT_DATA32(value)   (EMAFE_DATA_DATA_32BIT_DATA32_Msk & (_UINT32_(value) << EMAFE_DATA_DATA_32BIT_DATA32_Pos))
#define EMAFE_DATA_DATA_32BIT_Msk             _UINT32_(0xFFFFFFFF)                                  /* (EMAFE_DATA_DATA_32BIT) Register Mask  */


/* -------- EMAFE_CHA_CFG1 : (EMAFE Offset: 0x40) (R/W 32) Channel A Comparison Configuration 1 -------- */
#define EMAFE_CHA_CFG1_THRESH1_Pos            _UINT32_(0)                                          /* (EMAFE_CHA_CFG1) Threshold 1 for Channel A Position */
#define EMAFE_CHA_CFG1_THRESH1_Msk            (_UINT32_(0xFFFFFF) << EMAFE_CHA_CFG1_THRESH1_Pos)   /* (EMAFE_CHA_CFG1) Threshold 1 for Channel A Mask */
#define EMAFE_CHA_CFG1_THRESH1(value)         (EMAFE_CHA_CFG1_THRESH1_Msk & (_UINT32_(value) << EMAFE_CHA_CFG1_THRESH1_Pos)) /* Assigment of value for THRESH1 in the EMAFE_CHA_CFG1 register */
#define EMAFE_CHA_CFG1_IDX_Pos                _UINT32_(24)                                         /* (EMAFE_CHA_CFG1) Channel A Index Position */
#define EMAFE_CHA_CFG1_IDX_Msk                (_UINT32_(0x7) << EMAFE_CHA_CFG1_IDX_Pos)            /* (EMAFE_CHA_CFG1) Channel A Index Mask */
#define EMAFE_CHA_CFG1_IDX(value)             (EMAFE_CHA_CFG1_IDX_Msk & (_UINT32_(value) << EMAFE_CHA_CFG1_IDX_Pos)) /* Assigment of value for IDX in the EMAFE_CHA_CFG1 register */
#define   EMAFE_CHA_CFG1_IDX_CH0_Val          _UINT32_(0x0)                                        /* (EMAFE_CHA_CFG1) Channel 0 is selected.  */
#define   EMAFE_CHA_CFG1_IDX_CH1_Val          _UINT32_(0x1)                                        /* (EMAFE_CHA_CFG1) Channel 1 is selected.  */
#define   EMAFE_CHA_CFG1_IDX_CH2_Val          _UINT32_(0x2)                                        /* (EMAFE_CHA_CFG1) Channel 2 is selected.  */
#define   EMAFE_CHA_CFG1_IDX_CH3_Val          _UINT32_(0x3)                                        /* (EMAFE_CHA_CFG1) Channel 3 is selected.  */
#define   EMAFE_CHA_CFG1_IDX_CH4_Val          _UINT32_(0x4)                                        /* (EMAFE_CHA_CFG1) Channel 4 is selected.  */
#define   EMAFE_CHA_CFG1_IDX_CH5_Val          _UINT32_(0x5)                                        /* (EMAFE_CHA_CFG1) Channel 5 is selected.  */
#define   EMAFE_CHA_CFG1_IDX_CH6_Val          _UINT32_(0x6)                                        /* (EMAFE_CHA_CFG1) Channel 6 is selected.  */
#define EMAFE_CHA_CFG1_IDX_CH0                (EMAFE_CHA_CFG1_IDX_CH0_Val << EMAFE_CHA_CFG1_IDX_Pos) /* (EMAFE_CHA_CFG1) Channel 0 is selected. Position  */
#define EMAFE_CHA_CFG1_IDX_CH1                (EMAFE_CHA_CFG1_IDX_CH1_Val << EMAFE_CHA_CFG1_IDX_Pos) /* (EMAFE_CHA_CFG1) Channel 1 is selected. Position  */
#define EMAFE_CHA_CFG1_IDX_CH2                (EMAFE_CHA_CFG1_IDX_CH2_Val << EMAFE_CHA_CFG1_IDX_Pos) /* (EMAFE_CHA_CFG1) Channel 2 is selected. Position  */
#define EMAFE_CHA_CFG1_IDX_CH3                (EMAFE_CHA_CFG1_IDX_CH3_Val << EMAFE_CHA_CFG1_IDX_Pos) /* (EMAFE_CHA_CFG1) Channel 3 is selected. Position  */
#define EMAFE_CHA_CFG1_IDX_CH4                (EMAFE_CHA_CFG1_IDX_CH4_Val << EMAFE_CHA_CFG1_IDX_Pos) /* (EMAFE_CHA_CFG1) Channel 4 is selected. Position  */
#define EMAFE_CHA_CFG1_IDX_CH5                (EMAFE_CHA_CFG1_IDX_CH5_Val << EMAFE_CHA_CFG1_IDX_Pos) /* (EMAFE_CHA_CFG1) Channel 5 is selected. Position  */
#define EMAFE_CHA_CFG1_IDX_CH6                (EMAFE_CHA_CFG1_IDX_CH6_Val << EMAFE_CHA_CFG1_IDX_Pos) /* (EMAFE_CHA_CFG1) Channel 6 is selected. Position  */
#define EMAFE_CHA_CFG1_COND_Pos               _UINT32_(29)                                         /* (EMAFE_CHA_CFG1) Condition Applied for Detection on Channel A Position */
#define EMAFE_CHA_CFG1_COND_Msk               (_UINT32_(0x1) << EMAFE_CHA_CFG1_COND_Pos)           /* (EMAFE_CHA_CFG1) Condition Applied for Detection on Channel A Mask */
#define EMAFE_CHA_CFG1_COND(value)            (EMAFE_CHA_CFG1_COND_Msk & (_UINT32_(value) << EMAFE_CHA_CFG1_COND_Pos)) /* Assigment of value for COND in the EMAFE_CHA_CFG1 register */
#define   EMAFE_CHA_CFG1_COND_OR_Val          _UINT32_(0x0)                                        /* (EMAFE_CHA_CFG1) Selected channel data is lower than THRESH1 OR higher than THRESH2.  */
#define   EMAFE_CHA_CFG1_COND_AND_Val         _UINT32_(0x1)                                        /* (EMAFE_CHA_CFG1) Selected channel data is lower than THRESH1 AND higher than THRESH2.  */
#define EMAFE_CHA_CFG1_COND_OR                (EMAFE_CHA_CFG1_COND_OR_Val << EMAFE_CHA_CFG1_COND_Pos) /* (EMAFE_CHA_CFG1) Selected channel data is lower than THRESH1 OR higher than THRESH2. Position  */
#define EMAFE_CHA_CFG1_COND_AND               (EMAFE_CHA_CFG1_COND_AND_Val << EMAFE_CHA_CFG1_COND_Pos) /* (EMAFE_CHA_CFG1) Selected channel data is lower than THRESH1 AND higher than THRESH2. Position  */
#define EMAFE_CHA_CFG1_Msk                    _UINT32_(0x27FFFFFF)                                 /* (EMAFE_CHA_CFG1) Register Mask  */


/* -------- EMAFE_CHB_CFG1 : (EMAFE Offset: 0x44) (R/W 32) Channel B Comparison Configuration 1 -------- */
#define EMAFE_CHB_CFG1_THRESH1_Pos            _UINT32_(0)                                          /* (EMAFE_CHB_CFG1) Threshold 1 for Channel B Position */
#define EMAFE_CHB_CFG1_THRESH1_Msk            (_UINT32_(0xFFFFFF) << EMAFE_CHB_CFG1_THRESH1_Pos)   /* (EMAFE_CHB_CFG1) Threshold 1 for Channel B Mask */
#define EMAFE_CHB_CFG1_THRESH1(value)         (EMAFE_CHB_CFG1_THRESH1_Msk & (_UINT32_(value) << EMAFE_CHB_CFG1_THRESH1_Pos)) /* Assigment of value for THRESH1 in the EMAFE_CHB_CFG1 register */
#define EMAFE_CHB_CFG1_IDX_Pos                _UINT32_(24)                                         /* (EMAFE_CHB_CFG1) Channel B Index Position */
#define EMAFE_CHB_CFG1_IDX_Msk                (_UINT32_(0x7) << EMAFE_CHB_CFG1_IDX_Pos)            /* (EMAFE_CHB_CFG1) Channel B Index Mask */
#define EMAFE_CHB_CFG1_IDX(value)             (EMAFE_CHB_CFG1_IDX_Msk & (_UINT32_(value) << EMAFE_CHB_CFG1_IDX_Pos)) /* Assigment of value for IDX in the EMAFE_CHB_CFG1 register */
#define   EMAFE_CHB_CFG1_IDX_CH0_Val          _UINT32_(0x0)                                        /* (EMAFE_CHB_CFG1) Channel 0 is selected.  */
#define   EMAFE_CHB_CFG1_IDX_CH1_Val          _UINT32_(0x1)                                        /* (EMAFE_CHB_CFG1) Channel 1 is selected.  */
#define   EMAFE_CHB_CFG1_IDX_CH2_Val          _UINT32_(0x2)                                        /* (EMAFE_CHB_CFG1) Channel 2 is selected.  */
#define   EMAFE_CHB_CFG1_IDX_CH3_Val          _UINT32_(0x3)                                        /* (EMAFE_CHB_CFG1) Channel 3 is selected.  */
#define   EMAFE_CHB_CFG1_IDX_CH4_Val          _UINT32_(0x4)                                        /* (EMAFE_CHB_CFG1) Channel 4 is selected.  */
#define   EMAFE_CHB_CFG1_IDX_CH5_Val          _UINT32_(0x5)                                        /* (EMAFE_CHB_CFG1) Channel 5 is selected.  */
#define   EMAFE_CHB_CFG1_IDX_CH6_Val          _UINT32_(0x6)                                        /* (EMAFE_CHB_CFG1) Channel 6 is selected.  */
#define EMAFE_CHB_CFG1_IDX_CH0                (EMAFE_CHB_CFG1_IDX_CH0_Val << EMAFE_CHB_CFG1_IDX_Pos) /* (EMAFE_CHB_CFG1) Channel 0 is selected. Position  */
#define EMAFE_CHB_CFG1_IDX_CH1                (EMAFE_CHB_CFG1_IDX_CH1_Val << EMAFE_CHB_CFG1_IDX_Pos) /* (EMAFE_CHB_CFG1) Channel 1 is selected. Position  */
#define EMAFE_CHB_CFG1_IDX_CH2                (EMAFE_CHB_CFG1_IDX_CH2_Val << EMAFE_CHB_CFG1_IDX_Pos) /* (EMAFE_CHB_CFG1) Channel 2 is selected. Position  */
#define EMAFE_CHB_CFG1_IDX_CH3                (EMAFE_CHB_CFG1_IDX_CH3_Val << EMAFE_CHB_CFG1_IDX_Pos) /* (EMAFE_CHB_CFG1) Channel 3 is selected. Position  */
#define EMAFE_CHB_CFG1_IDX_CH4                (EMAFE_CHB_CFG1_IDX_CH4_Val << EMAFE_CHB_CFG1_IDX_Pos) /* (EMAFE_CHB_CFG1) Channel 4 is selected. Position  */
#define EMAFE_CHB_CFG1_IDX_CH5                (EMAFE_CHB_CFG1_IDX_CH5_Val << EMAFE_CHB_CFG1_IDX_Pos) /* (EMAFE_CHB_CFG1) Channel 5 is selected. Position  */
#define EMAFE_CHB_CFG1_IDX_CH6                (EMAFE_CHB_CFG1_IDX_CH6_Val << EMAFE_CHB_CFG1_IDX_Pos) /* (EMAFE_CHB_CFG1) Channel 6 is selected. Position  */
#define EMAFE_CHB_CFG1_COND_Pos               _UINT32_(29)                                         /* (EMAFE_CHB_CFG1) Condition Applied for Detection on Channel B Position */
#define EMAFE_CHB_CFG1_COND_Msk               (_UINT32_(0x1) << EMAFE_CHB_CFG1_COND_Pos)           /* (EMAFE_CHB_CFG1) Condition Applied for Detection on Channel B Mask */
#define EMAFE_CHB_CFG1_COND(value)            (EMAFE_CHB_CFG1_COND_Msk & (_UINT32_(value) << EMAFE_CHB_CFG1_COND_Pos)) /* Assigment of value for COND in the EMAFE_CHB_CFG1 register */
#define   EMAFE_CHB_CFG1_COND_OR_Val          _UINT32_(0x0)                                        /* (EMAFE_CHB_CFG1) Selected channel data is lower than THRESH1 OR higher than THRESH2.  */
#define   EMAFE_CHB_CFG1_COND_AND_Val         _UINT32_(0x1)                                        /* (EMAFE_CHB_CFG1) Selected channel data is lower than THRESH1 AND higher than THRESH2.  */
#define EMAFE_CHB_CFG1_COND_OR                (EMAFE_CHB_CFG1_COND_OR_Val << EMAFE_CHB_CFG1_COND_Pos) /* (EMAFE_CHB_CFG1) Selected channel data is lower than THRESH1 OR higher than THRESH2. Position  */
#define EMAFE_CHB_CFG1_COND_AND               (EMAFE_CHB_CFG1_COND_AND_Val << EMAFE_CHB_CFG1_COND_Pos) /* (EMAFE_CHB_CFG1) Selected channel data is lower than THRESH1 AND higher than THRESH2. Position  */
#define EMAFE_CHB_CFG1_Msk                    _UINT32_(0x27FFFFFF)                                 /* (EMAFE_CHB_CFG1) Register Mask  */


/* -------- EMAFE_CHA_CFG2 : (EMAFE Offset: 0x48) (R/W 32) Channel A Comparison Configuration 2 -------- */
#define EMAFE_CHA_CFG2_THRESH2_Pos            _UINT32_(0)                                          /* (EMAFE_CHA_CFG2) Threshold 2 for Channel A Position */
#define EMAFE_CHA_CFG2_THRESH2_Msk            (_UINT32_(0xFFFFFF) << EMAFE_CHA_CFG2_THRESH2_Pos)   /* (EMAFE_CHA_CFG2) Threshold 2 for Channel A Mask */
#define EMAFE_CHA_CFG2_THRESH2(value)         (EMAFE_CHA_CFG2_THRESH2_Msk & (_UINT32_(value) << EMAFE_CHA_CFG2_THRESH2_Pos)) /* Assigment of value for THRESH2 in the EMAFE_CHA_CFG2 register */
#define EMAFE_CHA_CFG2_Msk                    _UINT32_(0x00FFFFFF)                                 /* (EMAFE_CHA_CFG2) Register Mask  */


/* -------- EMAFE_CHB_CFG2 : (EMAFE Offset: 0x4C) (R/W 32) Channel B Comparison Configuration 2 -------- */
#define EMAFE_CHB_CFG2_THRESH2_Pos            _UINT32_(0)                                          /* (EMAFE_CHB_CFG2) Threshold 2 for Channel B Position */
#define EMAFE_CHB_CFG2_THRESH2_Msk            (_UINT32_(0xFFFFFF) << EMAFE_CHB_CFG2_THRESH2_Pos)   /* (EMAFE_CHB_CFG2) Threshold 2 for Channel B Mask */
#define EMAFE_CHB_CFG2_THRESH2(value)         (EMAFE_CHB_CFG2_THRESH2_Msk & (_UINT32_(value) << EMAFE_CHB_CFG2_THRESH2_Pos)) /* Assigment of value for THRESH2 in the EMAFE_CHB_CFG2 register */
#define EMAFE_CHB_CFG2_Msk                    _UINT32_(0x00FFFFFF)                                 /* (EMAFE_CHB_CFG2) Register Mask  */


/* -------- EMAFE_IER : (EMAFE Offset: 0x50) ( /W 32) Interrupt Enable Register -------- */
#define EMAFE_IER_DRDY_Pos                    _UINT32_(0)                                          /* (EMAFE_IER) Data Ready Interrupt Enable Position */
#define EMAFE_IER_DRDY_Msk                    (_UINT32_(0x1) << EMAFE_IER_DRDY_Pos)                /* (EMAFE_IER) Data Ready Interrupt Enable Mask */
#define EMAFE_IER_DRDY(value)                 (EMAFE_IER_DRDY_Msk & (_UINT32_(value) << EMAFE_IER_DRDY_Pos)) /* Assigment of value for DRDY in the EMAFE_IER register */
#define EMAFE_IER_RXUDR_Pos                   _UINT32_(1)                                          /* (EMAFE_IER) Receive Underflow Flow Interrupt Enable Position */
#define EMAFE_IER_RXUDR_Msk                   (_UINT32_(0x1) << EMAFE_IER_RXUDR_Pos)               /* (EMAFE_IER) Receive Underflow Flow Interrupt Enable Mask */
#define EMAFE_IER_RXUDR(value)                (EMAFE_IER_RXUDR_Msk & (_UINT32_(value) << EMAFE_IER_RXUDR_Pos)) /* Assigment of value for RXUDR in the EMAFE_IER register */
#define EMAFE_IER_RXFULL_Pos                  _UINT32_(2)                                          /* (EMAFE_IER) Receive FIFO Full Interrupt Enable Position */
#define EMAFE_IER_RXFULL_Msk                  (_UINT32_(0x1) << EMAFE_IER_RXFULL_Pos)              /* (EMAFE_IER) Receive FIFO Full Interrupt Enable Mask */
#define EMAFE_IER_RXFULL(value)               (EMAFE_IER_RXFULL_Msk & (_UINT32_(value) << EMAFE_IER_RXFULL_Pos)) /* Assigment of value for RXFULL in the EMAFE_IER register */
#define EMAFE_IER_RXEMPTY_Pos                 _UINT32_(3)                                          /* (EMAFE_IER) Receive FIFO Empty Interrupt Enable Position */
#define EMAFE_IER_RXEMPTY_Msk                 (_UINT32_(0x1) << EMAFE_IER_RXEMPTY_Pos)             /* (EMAFE_IER) Receive FIFO Empty Interrupt Enable Mask */
#define EMAFE_IER_RXEMPTY(value)              (EMAFE_IER_RXEMPTY_Msk & (_UINT32_(value) << EMAFE_IER_RXEMPTY_Pos)) /* Assigment of value for RXEMPTY in the EMAFE_IER register */
#define EMAFE_IER_CHCHG_Pos                   _UINT32_(4)                                          /* (EMAFE_IER) Channel Data Change Interrupt Enable Position */
#define EMAFE_IER_CHCHG_Msk                   (_UINT32_(0x1) << EMAFE_IER_CHCHG_Pos)               /* (EMAFE_IER) Channel Data Change Interrupt Enable Mask */
#define EMAFE_IER_CHCHG(value)                (EMAFE_IER_CHCHG_Msk & (_UINT32_(value) << EMAFE_IER_CHCHG_Pos)) /* Assigment of value for CHCHG in the EMAFE_IER register */
#define EMAFE_IER_CHDIFF_Pos                  _UINT32_(5)                                          /* (EMAFE_IER) Comparison Flag Interrupt Enable Position */
#define EMAFE_IER_CHDIFF_Msk                  (_UINT32_(0x1) << EMAFE_IER_CHDIFF_Pos)              /* (EMAFE_IER) Comparison Flag Interrupt Enable Mask */
#define EMAFE_IER_CHDIFF(value)               (EMAFE_IER_CHDIFF_Msk & (_UINT32_(value) << EMAFE_IER_CHDIFF_Pos)) /* Assigment of value for CHDIFF in the EMAFE_IER register */
#define EMAFE_IER_PARERROR_Pos                _UINT32_(6)                                          /* (EMAFE_IER) Parity Error Interrupt Enable Position */
#define EMAFE_IER_PARERROR_Msk                (_UINT32_(0x1) << EMAFE_IER_PARERROR_Pos)            /* (EMAFE_IER) Parity Error Interrupt Enable Mask */
#define EMAFE_IER_PARERROR(value)             (EMAFE_IER_PARERROR_Msk & (_UINT32_(value) << EMAFE_IER_PARERROR_Pos)) /* Assigment of value for PARERROR in the EMAFE_IER register */
#define EMAFE_IER_ENDRX_Pos                   _UINT32_(7)                                          /* (EMAFE_IER) PDC Receive Transfer End Interrupt Enable Position */
#define EMAFE_IER_ENDRX_Msk                   (_UINT32_(0x1) << EMAFE_IER_ENDRX_Pos)               /* (EMAFE_IER) PDC Receive Transfer End Interrupt Enable Mask */
#define EMAFE_IER_ENDRX(value)                (EMAFE_IER_ENDRX_Msk & (_UINT32_(value) << EMAFE_IER_ENDRX_Pos)) /* Assigment of value for ENDRX in the EMAFE_IER register */
#define EMAFE_IER_RXBUFF_Pos                  _UINT32_(8)                                          /* (EMAFE_IER) PDC Receive Buffer Full Interrupt Enable Position */
#define EMAFE_IER_RXBUFF_Msk                  (_UINT32_(0x1) << EMAFE_IER_RXBUFF_Pos)              /* (EMAFE_IER) PDC Receive Buffer Full Interrupt Enable Mask */
#define EMAFE_IER_RXBUFF(value)               (EMAFE_IER_RXBUFF_Msk & (_UINT32_(value) << EMAFE_IER_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the EMAFE_IER register */
#define EMAFE_IER_CHAEVT_Pos                  _UINT32_(9)                                          /* (EMAFE_IER) Channel A Event Interrupt Enable Position */
#define EMAFE_IER_CHAEVT_Msk                  (_UINT32_(0x1) << EMAFE_IER_CHAEVT_Pos)              /* (EMAFE_IER) Channel A Event Interrupt Enable Mask */
#define EMAFE_IER_CHAEVT(value)               (EMAFE_IER_CHAEVT_Msk & (_UINT32_(value) << EMAFE_IER_CHAEVT_Pos)) /* Assigment of value for CHAEVT in the EMAFE_IER register */
#define EMAFE_IER_CHBEVT_Pos                  _UINT32_(10)                                         /* (EMAFE_IER) Channel B Event Interrupt Enable Position */
#define EMAFE_IER_CHBEVT_Msk                  (_UINT32_(0x1) << EMAFE_IER_CHBEVT_Pos)              /* (EMAFE_IER) Channel B Event Interrupt Enable Mask */
#define EMAFE_IER_CHBEVT(value)               (EMAFE_IER_CHBEVT_Msk & (_UINT32_(value) << EMAFE_IER_CHBEVT_Pos)) /* Assigment of value for CHBEVT in the EMAFE_IER register */
#define EMAFE_IER_Msk                         _UINT32_(0x000007FF)                                 /* (EMAFE_IER) Register Mask  */


