Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/include/component/emafe.h
/* -------- EMAFE_IDR : (EMAFE Offset: 0x54) ( /W 32) Interrupt Disable Register -------- */
#define EMAFE_IDR_DRDY_Pos                    _UINT32_(0)                                          /* (EMAFE_IDR) Data Ready Interrupt Disable Position */
#define EMAFE_IDR_DRDY_Msk                    (_UINT32_(0x1) << EMAFE_IDR_DRDY_Pos)                /* (EMAFE_IDR) Data Ready Interrupt Disable Mask */
#define EMAFE_IDR_DRDY(value)                 (EMAFE_IDR_DRDY_Msk & (_UINT32_(value) << EMAFE_IDR_DRDY_Pos)) /* Assigment of value for DRDY in the EMAFE_IDR register */
#define EMAFE_IDR_RXUDR_Pos                   _UINT32_(1)                                          /* (EMAFE_IDR) Receive Underflow Flow Interrupt Disable Position */
#define EMAFE_IDR_RXUDR_Msk                   (_UINT32_(0x1) << EMAFE_IDR_RXUDR_Pos)               /* (EMAFE_IDR) Receive Underflow Flow Interrupt Disable Mask */
#define EMAFE_IDR_RXUDR(value)                (EMAFE_IDR_RXUDR_Msk & (_UINT32_(value) << EMAFE_IDR_RXUDR_Pos)) /* Assigment of value for RXUDR in the EMAFE_IDR register */
#define EMAFE_IDR_RXFULL_Pos                  _UINT32_(2)                                          /* (EMAFE_IDR) Receive FIFO Full Interrupt Disable Position */
#define EMAFE_IDR_RXFULL_Msk                  (_UINT32_(0x1) << EMAFE_IDR_RXFULL_Pos)              /* (EMAFE_IDR) Receive FIFO Full Interrupt Disable Mask */
#define EMAFE_IDR_RXFULL(value)               (EMAFE_IDR_RXFULL_Msk & (_UINT32_(value) << EMAFE_IDR_RXFULL_Pos)) /* Assigment of value for RXFULL in the EMAFE_IDR register */
#define EMAFE_IDR_RXEMPTY_Pos                 _UINT32_(3)                                          /* (EMAFE_IDR) Receive FIFO Empty Interrupt Disable Position */
#define EMAFE_IDR_RXEMPTY_Msk                 (_UINT32_(0x1) << EMAFE_IDR_RXEMPTY_Pos)             /* (EMAFE_IDR) Receive FIFO Empty Interrupt Disable Mask */
#define EMAFE_IDR_RXEMPTY(value)              (EMAFE_IDR_RXEMPTY_Msk & (_UINT32_(value) << EMAFE_IDR_RXEMPTY_Pos)) /* Assigment of value for RXEMPTY in the EMAFE_IDR register */
#define EMAFE_IDR_CHCHG_Pos                   _UINT32_(4)                                          /* (EMAFE_IDR) Channel Data Change Interrupt Disable Position */
#define EMAFE_IDR_CHCHG_Msk                   (_UINT32_(0x1) << EMAFE_IDR_CHCHG_Pos)               /* (EMAFE_IDR) Channel Data Change Interrupt Disable Mask */
#define EMAFE_IDR_CHCHG(value)                (EMAFE_IDR_CHCHG_Msk & (_UINT32_(value) << EMAFE_IDR_CHCHG_Pos)) /* Assigment of value for CHCHG in the EMAFE_IDR register */
#define EMAFE_IDR_CHDIFF_Pos                  _UINT32_(5)                                          /* (EMAFE_IDR) Comparison Flag Interrupt Disable Position */
#define EMAFE_IDR_CHDIFF_Msk                  (_UINT32_(0x1) << EMAFE_IDR_CHDIFF_Pos)              /* (EMAFE_IDR) Comparison Flag Interrupt Disable Mask */
#define EMAFE_IDR_CHDIFF(value)               (EMAFE_IDR_CHDIFF_Msk & (_UINT32_(value) << EMAFE_IDR_CHDIFF_Pos)) /* Assigment of value for CHDIFF in the EMAFE_IDR register */
#define EMAFE_IDR_PARERROR_Pos                _UINT32_(6)                                          /* (EMAFE_IDR) Parity Error Interrupt Disable Position */
#define EMAFE_IDR_PARERROR_Msk                (_UINT32_(0x1) << EMAFE_IDR_PARERROR_Pos)            /* (EMAFE_IDR) Parity Error Interrupt Disable Mask */
#define EMAFE_IDR_PARERROR(value)             (EMAFE_IDR_PARERROR_Msk & (_UINT32_(value) << EMAFE_IDR_PARERROR_Pos)) /* Assigment of value for PARERROR in the EMAFE_IDR register */
#define EMAFE_IDR_ENDRX_Pos                   _UINT32_(7)                                          /* (EMAFE_IDR) PDC Receive Transfer End Interrupt Disable Position */
#define EMAFE_IDR_ENDRX_Msk                   (_UINT32_(0x1) << EMAFE_IDR_ENDRX_Pos)               /* (EMAFE_IDR) PDC Receive Transfer End Interrupt Disable Mask */
#define EMAFE_IDR_ENDRX(value)                (EMAFE_IDR_ENDRX_Msk & (_UINT32_(value) << EMAFE_IDR_ENDRX_Pos)) /* Assigment of value for ENDRX in the EMAFE_IDR register */
#define EMAFE_IDR_RXBUFF_Pos                  _UINT32_(8)                                          /* (EMAFE_IDR) PDC Receive Buffer Full Interrupt Disable Position */
#define EMAFE_IDR_RXBUFF_Msk                  (_UINT32_(0x1) << EMAFE_IDR_RXBUFF_Pos)              /* (EMAFE_IDR) PDC Receive Buffer Full Interrupt Disable Mask */
#define EMAFE_IDR_RXBUFF(value)               (EMAFE_IDR_RXBUFF_Msk & (_UINT32_(value) << EMAFE_IDR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the EMAFE_IDR register */
#define EMAFE_IDR_CHAEVT_Pos                  _UINT32_(9)                                          /* (EMAFE_IDR) Threshold Channel A Interrupt Disable Position */
#define EMAFE_IDR_CHAEVT_Msk                  (_UINT32_(0x1) << EMAFE_IDR_CHAEVT_Pos)              /* (EMAFE_IDR) Threshold Channel A Interrupt Disable Mask */
#define EMAFE_IDR_CHAEVT(value)               (EMAFE_IDR_CHAEVT_Msk & (_UINT32_(value) << EMAFE_IDR_CHAEVT_Pos)) /* Assigment of value for CHAEVT in the EMAFE_IDR register */
#define EMAFE_IDR_CHBEVT_Pos                  _UINT32_(10)                                         /* (EMAFE_IDR) Threshold Channel B Interrupt Disable Position */
#define EMAFE_IDR_CHBEVT_Msk                  (_UINT32_(0x1) << EMAFE_IDR_CHBEVT_Pos)              /* (EMAFE_IDR) Threshold Channel B Interrupt Disable Mask */
#define EMAFE_IDR_CHBEVT(value)               (EMAFE_IDR_CHBEVT_Msk & (_UINT32_(value) << EMAFE_IDR_CHBEVT_Pos)) /* Assigment of value for CHBEVT in the EMAFE_IDR register */
#define EMAFE_IDR_Msk                         _UINT32_(0x000007FF)                                 /* (EMAFE_IDR) Register Mask  */


/* -------- EMAFE_IMR : (EMAFE Offset: 0x58) ( R/ 32) Interrupt Mask Register -------- */
#define EMAFE_IMR_DRDY_Pos                    _UINT32_(0)                                          /* (EMAFE_IMR) Data Ready Interrupt Mask Position */
#define EMAFE_IMR_DRDY_Msk                    (_UINT32_(0x1) << EMAFE_IMR_DRDY_Pos)                /* (EMAFE_IMR) Data Ready Interrupt Mask Mask */
#define EMAFE_IMR_DRDY(value)                 (EMAFE_IMR_DRDY_Msk & (_UINT32_(value) << EMAFE_IMR_DRDY_Pos)) /* Assigment of value for DRDY in the EMAFE_IMR register */
#define EMAFE_IMR_RXUDR_Pos                   _UINT32_(1)                                          /* (EMAFE_IMR) Receive Underflow Flow Interrupt Mask Position */
#define EMAFE_IMR_RXUDR_Msk                   (_UINT32_(0x1) << EMAFE_IMR_RXUDR_Pos)               /* (EMAFE_IMR) Receive Underflow Flow Interrupt Mask Mask */
#define EMAFE_IMR_RXUDR(value)                (EMAFE_IMR_RXUDR_Msk & (_UINT32_(value) << EMAFE_IMR_RXUDR_Pos)) /* Assigment of value for RXUDR in the EMAFE_IMR register */
#define EMAFE_IMR_RXFULL_Pos                  _UINT32_(2)                                          /* (EMAFE_IMR) Receive FIFO Full Interrupt Mask Position */
#define EMAFE_IMR_RXFULL_Msk                  (_UINT32_(0x1) << EMAFE_IMR_RXFULL_Pos)              /* (EMAFE_IMR) Receive FIFO Full Interrupt Mask Mask */
#define EMAFE_IMR_RXFULL(value)               (EMAFE_IMR_RXFULL_Msk & (_UINT32_(value) << EMAFE_IMR_RXFULL_Pos)) /* Assigment of value for RXFULL in the EMAFE_IMR register */
#define EMAFE_IMR_RXEMPTY_Pos                 _UINT32_(3)                                          /* (EMAFE_IMR) Receive FIFO Empty Interrupt Mask Position */
#define EMAFE_IMR_RXEMPTY_Msk                 (_UINT32_(0x1) << EMAFE_IMR_RXEMPTY_Pos)             /* (EMAFE_IMR) Receive FIFO Empty Interrupt Mask Mask */
#define EMAFE_IMR_RXEMPTY(value)              (EMAFE_IMR_RXEMPTY_Msk & (_UINT32_(value) << EMAFE_IMR_RXEMPTY_Pos)) /* Assigment of value for RXEMPTY in the EMAFE_IMR register */
#define EMAFE_IMR_CHCHG_Pos                   _UINT32_(4)                                          /* (EMAFE_IMR) Channel Data Change Interrupt Mask Position */
#define EMAFE_IMR_CHCHG_Msk                   (_UINT32_(0x1) << EMAFE_IMR_CHCHG_Pos)               /* (EMAFE_IMR) Channel Data Change Interrupt Mask Mask */
#define EMAFE_IMR_CHCHG(value)                (EMAFE_IMR_CHCHG_Msk & (_UINT32_(value) << EMAFE_IMR_CHCHG_Pos)) /* Assigment of value for CHCHG in the EMAFE_IMR register */
#define EMAFE_IMR_CHDIFF_Pos                  _UINT32_(5)                                          /* (EMAFE_IMR) Comparison Flag Interrupt Mask Position */
#define EMAFE_IMR_CHDIFF_Msk                  (_UINT32_(0x1) << EMAFE_IMR_CHDIFF_Pos)              /* (EMAFE_IMR) Comparison Flag Interrupt Mask Mask */
#define EMAFE_IMR_CHDIFF(value)               (EMAFE_IMR_CHDIFF_Msk & (_UINT32_(value) << EMAFE_IMR_CHDIFF_Pos)) /* Assigment of value for CHDIFF in the EMAFE_IMR register */
#define EMAFE_IMR_PARERROR_Pos                _UINT32_(6)                                          /* (EMAFE_IMR) Parity Error Interrupt Mask Position */
#define EMAFE_IMR_PARERROR_Msk                (_UINT32_(0x1) << EMAFE_IMR_PARERROR_Pos)            /* (EMAFE_IMR) Parity Error Interrupt Mask Mask */
#define EMAFE_IMR_PARERROR(value)             (EMAFE_IMR_PARERROR_Msk & (_UINT32_(value) << EMAFE_IMR_PARERROR_Pos)) /* Assigment of value for PARERROR in the EMAFE_IMR register */
#define EMAFE_IMR_ENDRX_Pos                   _UINT32_(7)                                          /* (EMAFE_IMR) PDC Receive Transfer End Interrupt Mask Position */
#define EMAFE_IMR_ENDRX_Msk                   (_UINT32_(0x1) << EMAFE_IMR_ENDRX_Pos)               /* (EMAFE_IMR) PDC Receive Transfer End Interrupt Mask Mask */
#define EMAFE_IMR_ENDRX(value)                (EMAFE_IMR_ENDRX_Msk & (_UINT32_(value) << EMAFE_IMR_ENDRX_Pos)) /* Assigment of value for ENDRX in the EMAFE_IMR register */
#define EMAFE_IMR_RXBUFF_Pos                  _UINT32_(8)                                          /* (EMAFE_IMR) PDC Receive Buffer Full Interrupt Mask Position */
#define EMAFE_IMR_RXBUFF_Msk                  (_UINT32_(0x1) << EMAFE_IMR_RXBUFF_Pos)              /* (EMAFE_IMR) PDC Receive Buffer Full Interrupt Mask Mask */
#define EMAFE_IMR_RXBUFF(value)               (EMAFE_IMR_RXBUFF_Msk & (_UINT32_(value) << EMAFE_IMR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the EMAFE_IMR register */
#define EMAFE_IMR_CHAEVT_Pos                  _UINT32_(9)                                          /* (EMAFE_IMR) Channel A Interrupt Mask Position */
#define EMAFE_IMR_CHAEVT_Msk                  (_UINT32_(0x1) << EMAFE_IMR_CHAEVT_Pos)              /* (EMAFE_IMR) Channel A Interrupt Mask Mask */
#define EMAFE_IMR_CHAEVT(value)               (EMAFE_IMR_CHAEVT_Msk & (_UINT32_(value) << EMAFE_IMR_CHAEVT_Pos)) /* Assigment of value for CHAEVT in the EMAFE_IMR register */
#define EMAFE_IMR_CHBEVT_Pos                  _UINT32_(10)                                         /* (EMAFE_IMR) Channel B Interrupt Mask Position */
#define EMAFE_IMR_CHBEVT_Msk                  (_UINT32_(0x1) << EMAFE_IMR_CHBEVT_Pos)              /* (EMAFE_IMR) Channel B Interrupt Mask Mask */
#define EMAFE_IMR_CHBEVT(value)               (EMAFE_IMR_CHBEVT_Msk & (_UINT32_(value) << EMAFE_IMR_CHBEVT_Pos)) /* Assigment of value for CHBEVT in the EMAFE_IMR register */
#define EMAFE_IMR_Msk                         _UINT32_(0x000007FF)                                 /* (EMAFE_IMR) Register Mask  */


/* -------- EMAFE_ISR : (EMAFE Offset: 0x5C) ( R/ 32) Interrupt Status Register -------- */
#define EMAFE_ISR_DRDY_Pos                    _UINT32_(0)                                          /* (EMAFE_ISR) Data Ready (cleared on read) Position */
#define EMAFE_ISR_DRDY_Msk                    (_UINT32_(0x1) << EMAFE_ISR_DRDY_Pos)                /* (EMAFE_ISR) Data Ready (cleared on read) Mask */
#define EMAFE_ISR_DRDY(value)                 (EMAFE_ISR_DRDY_Msk & (_UINT32_(value) << EMAFE_ISR_DRDY_Pos)) /* Assigment of value for DRDY in the EMAFE_ISR register */
#define EMAFE_ISR_RXUDR_Pos                   _UINT32_(1)                                          /* (EMAFE_ISR) Receive Under Flow (cleared on read) Position */
#define EMAFE_ISR_RXUDR_Msk                   (_UINT32_(0x1) << EMAFE_ISR_RXUDR_Pos)               /* (EMAFE_ISR) Receive Under Flow (cleared on read) Mask */
#define EMAFE_ISR_RXUDR(value)                (EMAFE_ISR_RXUDR_Msk & (_UINT32_(value) << EMAFE_ISR_RXUDR_Pos)) /* Assigment of value for RXUDR in the EMAFE_ISR register */
#define EMAFE_ISR_RXFULL_Pos                  _UINT32_(2)                                          /* (EMAFE_ISR) Receive FIFO Full (cleared on read) Position */
#define EMAFE_ISR_RXFULL_Msk                  (_UINT32_(0x1) << EMAFE_ISR_RXFULL_Pos)              /* (EMAFE_ISR) Receive FIFO Full (cleared on read) Mask */
#define EMAFE_ISR_RXFULL(value)               (EMAFE_ISR_RXFULL_Msk & (_UINT32_(value) << EMAFE_ISR_RXFULL_Pos)) /* Assigment of value for RXFULL in the EMAFE_ISR register */
#define EMAFE_ISR_RXEMPTY_Pos                 _UINT32_(3)                                          /* (EMAFE_ISR) Receive FIFO Empty (cleared on read) Position */
#define EMAFE_ISR_RXEMPTY_Msk                 (_UINT32_(0x1) << EMAFE_ISR_RXEMPTY_Pos)             /* (EMAFE_ISR) Receive FIFO Empty (cleared on read) Mask */
#define EMAFE_ISR_RXEMPTY(value)              (EMAFE_ISR_RXEMPTY_Msk & (_UINT32_(value) << EMAFE_ISR_RXEMPTY_Pos)) /* Assigment of value for RXEMPTY in the EMAFE_ISR register */
#define EMAFE_ISR_CHCHG_Pos                   _UINT32_(4)                                          /* (EMAFE_ISR) Channel Data Variation Detection Event (cleared on read) Position */
#define EMAFE_ISR_CHCHG_Msk                   (_UINT32_(0x1) << EMAFE_ISR_CHCHG_Pos)               /* (EMAFE_ISR) Channel Data Variation Detection Event (cleared on read) Mask */
#define EMAFE_ISR_CHCHG(value)                (EMAFE_ISR_CHCHG_Msk & (_UINT32_(value) << EMAFE_ISR_CHCHG_Pos)) /* Assigment of value for CHCHG in the EMAFE_ISR register */
#define EMAFE_ISR_CHDIFF_Pos                  _UINT32_(5)                                          /* (EMAFE_ISR) Channel Difference Comparison Event (cleared on read) Position */
#define EMAFE_ISR_CHDIFF_Msk                  (_UINT32_(0x1) << EMAFE_ISR_CHDIFF_Pos)              /* (EMAFE_ISR) Channel Difference Comparison Event (cleared on read) Mask */
#define EMAFE_ISR_CHDIFF(value)               (EMAFE_ISR_CHDIFF_Msk & (_UINT32_(value) << EMAFE_ISR_CHDIFF_Pos)) /* Assigment of value for CHDIFF in the EMAFE_ISR register */
#define EMAFE_ISR_PARERROR_Pos                _UINT32_(6)                                          /* (EMAFE_ISR) Parity Error Event (cleared on read) Position */
#define EMAFE_ISR_PARERROR_Msk                (_UINT32_(0x1) << EMAFE_ISR_PARERROR_Pos)            /* (EMAFE_ISR) Parity Error Event (cleared on read) Mask */
#define EMAFE_ISR_PARERROR(value)             (EMAFE_ISR_PARERROR_Msk & (_UINT32_(value) << EMAFE_ISR_PARERROR_Pos)) /* Assigment of value for PARERROR in the EMAFE_ISR register */
#define EMAFE_ISR_ENDRX_Pos                   _UINT32_(7)                                          /* (EMAFE_ISR) PDC Receive Transfer End Event (cleared by writing EMAFE_RCR or EMAFE_RNCR) Position */
#define EMAFE_ISR_ENDRX_Msk                   (_UINT32_(0x1) << EMAFE_ISR_ENDRX_Pos)               /* (EMAFE_ISR) PDC Receive Transfer End Event (cleared by writing EMAFE_RCR or EMAFE_RNCR) Mask */
#define EMAFE_ISR_ENDRX(value)                (EMAFE_ISR_ENDRX_Msk & (_UINT32_(value) << EMAFE_ISR_ENDRX_Pos)) /* Assigment of value for ENDRX in the EMAFE_ISR register */
#define EMAFE_ISR_RXBUFF_Pos                  _UINT32_(8)                                          /* (EMAFE_ISR) PDC Receive Buffer Full Event (cleared by writing EMAFE_RCR or EMAFE_RNCR) Position */
#define EMAFE_ISR_RXBUFF_Msk                  (_UINT32_(0x1) << EMAFE_ISR_RXBUFF_Pos)              /* (EMAFE_ISR) PDC Receive Buffer Full Event (cleared by writing EMAFE_RCR or EMAFE_RNCR) Mask */
#define EMAFE_ISR_RXBUFF(value)               (EMAFE_ISR_RXBUFF_Msk & (_UINT32_(value) << EMAFE_ISR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the EMAFE_ISR register */
#define EMAFE_ISR_CHAEVT_Pos                  _UINT32_(9)                                          /* (EMAFE_ISR) Channel A Event (cleared on read) Position */
#define EMAFE_ISR_CHAEVT_Msk                  (_UINT32_(0x1) << EMAFE_ISR_CHAEVT_Pos)              /* (EMAFE_ISR) Channel A Event (cleared on read) Mask */
#define EMAFE_ISR_CHAEVT(value)               (EMAFE_ISR_CHAEVT_Msk & (_UINT32_(value) << EMAFE_ISR_CHAEVT_Pos)) /* Assigment of value for CHAEVT in the EMAFE_ISR register */
#define EMAFE_ISR_CHBEVT_Pos                  _UINT32_(10)                                         /* (EMAFE_ISR) Channel B Event (cleared on read) Position */
#define EMAFE_ISR_CHBEVT_Msk                  (_UINT32_(0x1) << EMAFE_ISR_CHBEVT_Pos)              /* (EMAFE_ISR) Channel B Event (cleared on read) Mask */
#define EMAFE_ISR_CHBEVT(value)               (EMAFE_ISR_CHBEVT_Msk & (_UINT32_(value) << EMAFE_ISR_CHBEVT_Pos)) /* Assigment of value for CHBEVT in the EMAFE_ISR register */
#define EMAFE_ISR_Msk                         _UINT32_(0x000007FF)                                 /* (EMAFE_ISR) Register Mask  */


