Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/include/component/emafe.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief EMAFE register API structure */
typedef struct
{
  __O   uint32_t                       EMAFE_CR;           /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       EMAFE_MR;           /**< Offset: 0x04 (R/W  32) Mode Register */
  __IO  uint32_t                       EMAFE_CDCR;         /**< Offset: 0x08 (R/W  32) Channels Difference Comparison Register */
  __IO  uint32_t                       EMAFE_EMR;          /**< Offset: 0x0C (R/W  32) Extended Mode Register */
  __I   uint32_t                       EMAFE_DMA_DATA;     /**< Offset: 0x10 (R/   32) DMA Data Register */
  __I   uint32_t                       EMAFE_DATA[5];      /**< Offset: 0x14 (R/   32) Data Channel 0 Register */
  __I   uint8_t                        Reserved1[0x18];
  __IO  uint32_t                       EMAFE_CHA_CFG1;     /**< Offset: 0x40 (R/W  32) Channel A Comparison Configuration 1 */
  __IO  uint32_t                       EMAFE_CHB_CFG1;     /**< Offset: 0x44 (R/W  32) Channel B Comparison Configuration 1 */
  __IO  uint32_t                       EMAFE_CHA_CFG2;     /**< Offset: 0x48 (R/W  32) Channel A Comparison Configuration 2 */
  __IO  uint32_t                       EMAFE_CHB_CFG2;     /**< Offset: 0x4C (R/W  32) Channel B Comparison Configuration 2 */
  __O   uint32_t                       EMAFE_IER;          /**< Offset: 0x50 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       EMAFE_IDR;          /**< Offset: 0x54 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       EMAFE_IMR;          /**< Offset: 0x58 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       EMAFE_ISR;          /**< Offset: 0x5C (R/   32) Interrupt Status Register */
  __I   uint32_t                       EMAFE_SR;           /**< Offset: 0x60 (R/   32) Status Register */
  __I   uint8_t                        Reserved2[0x80];
  __IO  uint32_t                       EMAFE_WPMR;         /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       EMAFE_WPSR;         /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
  __I   uint8_t                        Reserved3[0x10];
  __I   uint32_t                       EMAFE_VERSION;      /**< Offset: 0xFC (R/   32) Version Register */
  __IO  uint32_t                       EMAFE_RPR;          /**< Offset: 0x100 (R/W  32) Receive Pointer Register */
  __IO  uint32_t                       EMAFE_RCR;          /**< Offset: 0x104 (R/W  32) Receive Counter Register */
  __I   uint8_t                        Reserved4[0x08];
  __IO  uint32_t                       EMAFE_RNPR;         /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register */
  __IO  uint32_t                       EMAFE_RNCR;         /**< Offset: 0x114 (R/W  32) Receive Next Counter Register */
  __I   uint8_t                        Reserved5[0x08];
  __O   uint32_t                       EMAFE_PTCR;         /**< Offset: 0x120 ( /W  32) Transfer Control Register */
  __I   uint32_t                       EMAFE_PTSR;         /**< Offset: 0x124 (R/   32) Transfer Status Register */
  __IO  uint32_t                       EMAFE_PWPMR;        /**< Offset: 0x128 (R/W  32) Write Protection Mode Register */
} emafe_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTSH_EMAFE_COMPONENT_H_ */
